Tekla Open API Reference for Tekla Structures 2025
FormingStates Properties
The FormingStates type exposes the following members.
Properties
Name | Description
Deforming
 Gets or sets the deforming type.
Folding
 Gets or sets the folding type.
Wrapping
 Gets or sets the wrapping type.
Top
See Also
Reference
FormingStates Class
Tekla.Structures.Forming Namespace